app/controllers/application_controller.rb

  def current_account
    # Знаходимо акаунт за ID з сесії, якщо він там є
    # @current_account ||= — вбудований прийом, щоб не питати базу двічі (memoization)
    @current_account ||= Account.find_by(id: session[:account_id]) if session[:account_id]
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 3 LIMIT 1