app/controllers/comments_controller.rb

  def like
    @comment = Comment.find(params[:id])
    # Шукаємо, чи вже є лайк від цього акаунта
    @reaction = @comment.comment_reactions.find_by(account: current_account)

    if @reaction
      @reaction.destroy # Якщо є — видаляємо (анлайк)
    else
      @comment.comment_reactions.create(account: current_account) # Якщо немає — створюємо
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5 LIMIT 1
SELECT "comment_reactions".* FROM "comment_reactions" WHERE "comment_reactions"."comment_id" = 5 AND "comment_reactions"."account_id" = 3 LIMIT 1
DELETE FROM "comment_reactions" WHERE "comment_reactions"."id" = 12
INSERT INTO "comment_reactions" ("account_id", "comment_id", "created_at", "updated_at") VALUES (4, 5, '2026-01-28 07:29:43.682381', '2026-01-28 07:29:43.682381') RETURNING "id"