app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:account, :comments, :reactions).all.order(created_at: :desc)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" IN (3, 1)
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (3, 1)
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" IN (3, 1)

  def create
    @post = current_account.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("account_id", "body", "created_at", "updated_at") VALUES (3, 'erf', '2026-01-27 14:56:53.021565', '2026-01-27 14:56:53.021565') RETURNING "id"

  def like
    @reaction = Reaction.find_by(account_id: current_account.id, post_id: @post.id)

    if @reaction
      @reaction.destroy
    else
      Reaction.create(account_id: current_account.id, post_id: @post.id)
---
SELECT "reactions".* FROM "reactions" WHERE "reactions"."account_id" = 3 AND "reactions"."post_id" = 1 LIMIT 1
DELETE FROM "reactions" WHERE "reactions"."id" = 21
INSERT INTO "reactions" ("account_id", "post_id", "created_at", "updated_at") VALUES (3, 3, '2026-01-27 14:56:56.466468', '2026-01-27 14:56:56.466468') RETURNING "id"