app/controllers/sessions_controller.rb

  def create
  account = Account.find_by(email: params[:email])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" = 'vika@gmail.com' LIMIT 1